[
  {
    "title": "If It’s Not a “Hell Yes,” is It a “No?”",
    "subtitle": "Examining this pop culture wisdom.",
    "author": "Michael Zick",
    "excerpt": "Is the phrase that’s supposed to protect you quietly becoming the thing that keeps you stuck? Distinguishing between a wise 'no' and fear masquerading as intuition.",
    "canonicalUrl": "https://medium.com/shortcuts/if-its-not-a-hell-yes-is-it-a-no-ca1d26da6034",
    "canonicalSource": "Medium",
    "imageUrl": "https://miro.medium.com/v2/resize:fit:1400/format:webp/0*6vRqxboxFuQ7PgXT",
    "body": "<p>We’ve all seen it:</p>\n<blockquote><p>“If it’s not a hell yes, it’s a no.”</p></blockquote>\n<p>It’s on Instagram, in self-help books, and in therapy sessions. It sounds like a powerful mantra rooted in the belief that decisions can be boiled down to a black-and-white, on-or-off, foolproof system.</p>\n<p>Just say “No” to anything that isn’t a full-body, lightning bolt of “YES!”</p>\n<p>Is that true, though? Or is life more nuanced than that?</p>\n<p>What happens when trauma, anxiety, or attachment styles hijack our nervous system so that anything real, intimate, or long-term feels more like “maybe” or even “RUN”?</p>\n<p>What happens when the phrase that’s supposed to protect you quietly becomes the thing that keeps you stuck?</p>\n<p>In this article, I’ll explore the realities of living in accordance with this phrase, and separate the meme-psych tropes from the useful information that’s grounded and self-aware.</p>\n<p>After all, what good is a catchy phrase if it reinforces maladaptive patterns?</p>\n<h2>Why “Hell Yes” or “No” Exists</h2>\n<p>On the surface, “hell yes or no” is seductive because it promises three things people desire:</p>\n<ul>\n<li>Clarity in a confusing world</li>\n<li>Boundaries, if you’ve lived without them</li>\n<li>Relief from rumination</li>\n</ul>\n<p>But here’s the thing — feelings can, and often are, wrong.</p>\n<p>That isn’t to say that you shouldn’t trust your gut, but the difference between a gut feeling that’s correct and a fear-based response is minute.</p>\n<p>It often takes years to tell the difference.</p>\n<p>For example, if you’ve spent your life saying yes to things you didn’t want — more work, more dates, more favors, more emotional labor — a rule like this feels like a rescue boat. But is it?</p>\n<p>People Pleasers are notorious for saying “yes” to things they regret later on, usually from a place of obligation, guilt, or a fear of being a disappointment. The resentment comes out sideways in the form of passive-aggressiveness or score-keeping, which often blurs the lines between a “hell yes” response and codependency.</p>\n<h2>Where “Hell Yes or No” Actually Works</h2>\n<h3>1. Big, energy-intensive commitments</h3>\n<p>The phrase is often helpful for choices that will shape your life for years:</p>\n<ul>\n<li>Romantic partners</li>\n<li>Major business partnerships</li>\n<li>Jobs that will dominate your time and mental space</li>\n<li>Long-term living situations</li>\n<li>Big creative projects that will cost enormous energy</li>\n</ul>\n<p>These are decisions where half-hearted yeses can turn into resentment.</p>\n<p>If you’re about to:</p>\n<ul>\n<li>Move in with someone</li>\n<li>Sign a multi-year lease</li>\n<li>Co-found a company</li>\n<li>Take a job that will own your weekdays and nervous system</li>\n</ul>\n<p>Then the question “Do I genuinely want this?” matters.</p>\n<p>Here, “hell yes” doesn’t mean butterflies and dopamine spikes. It means:</p>\n<ul>\n<li><strong>Inner alignment</strong>: “This matches who I am and what I want to build.”</li>\n<li><strong>Stable excitement</strong>: Not manic, not numb. Just a steady “Yes.”</li>\n<li><strong>Low self-betrayal</strong>: You’re not selling your values or peace of mind to get it.</li>\n</ul>\n<p>When used this way, “hell yes or no” becomes a boundary, not a personality trait. It’s a filter for high-cost commitments where lukewarm or unclear agreements can hurt everyone involved.</p>\n<h3>2. Social and emotional overcommitment</h3>\n<p>If you’re a chronic people-pleaser, this mantra can be temporary medicine.</p>\n<p>When every invitation triggers guilt —</p>\n<p>when you’d rather suffer than disappoint —</p>\n<p>“hell yes or no” can be a way to practice saying:</p>\n<blockquote><p>“If I don’t actually want to be there, I’m not going.”</p></blockquote>\n<p>It can retrain the nervous system to stop treating other people’s comfort as more important than one’s own emotional sanity.</p>\n<h2>Where the Phrase Falls Apart</h2>\n<p>The trouble starts when this rule stops being a tool and becomes a belief about how life is supposed to work.</p>\n<p>Because under the hood, it has a few hidden assumptions:</p>\n<ul>\n<li>That your feelings are always clear or true</li>\n<li>That your nervous system is a reliable compass</li>\n<li>That the best things in life start with certainty</li>\n<li>Or worse — the best things in life start with a BANG.</li>\n</ul>\n<p>That sounds nice, but it’s not reality.</p>\n<p>Let’s look at a few ways this mantra becomes harmful.</p>\n<h3>1. It Confuses Avoidance With Wisdom</h3>\n<p>Sometimes “not a hell yes” means:</p>\n<ul>\n<li>I’m genuinely not interested.</li>\n<li>This conflicts with my values.</li>\n<li>This would be a self-betrayal.</li>\n</ul>\n<p>But other times, not a “hell yes” secretly means:</p>\n<ul>\n<li>I’m terrified of being hurt.</li>\n<li>I’m afraid to be seen.</li>\n<li>If I commit and fail, what does that say about me?</li>\n<li>If they really know me, they’ll leave, so I'd better not start.</li>\n</ul>\n<p>The nervous system doesn’t send pop-up notifications labeled:</p>\n<blockquote><p>“Hey, just so you know, this ‘no’ is actually fear masquerading as intuition.”</p></blockquote>\n<p>It just sends a feeling of contraction, discomfort, or vague resistance. If the rule is “anything that isn’t a hell yes is a no,” fear wins every time.</p>\n<ul>\n<li>That promising relationship? Not a hell yes because vulnerability is terrifying.</li>\n<li>Is that job or project slightly above your current skill? Not a hell yes because imposter syndrome is screaming.</li>\n<li>That opportunity that requires being visible, pitching, or leading? Not a hell yes because childhood humiliation is still living in your nervous system.</li>\n</ul>\n<p>The mantra doesn’t differentiate between:</p>\n<blockquote><p>A wise no and a no that’s actually “I’m scared.”</p></blockquote>\n<p>So, fear gets to dress up in “boundaries” and calls itself self-care.</p>\n<h3>2. It Ignores How Many Great Things Start as “I Don’t Know Yet.”</h3>\n<p>Think about some of the most meaningful things a human can do:</p>\n<ul>\n<li>Healing</li>\n<li>Deep friendship</li>\n<li>Long-term love</li>\n<li>Fulfilling work</li>\n<li>Creative mastery</li>\n<li>Sobriety, meditation, or therapy</li>\n<li>Parenting, mentoring, teaching</li>\n</ul>\n<p>How many of those begin with a clean, thunderbolt HELL YES?</p>\n<p>More often, they start as:</p>\n<ul>\n<li>“I’m curious.”</li>\n<li>“I feel pulled toward this for reasons I can’t fully explain.”</li>\n<li>“I’m scared, but something in me wants to try.”</li>\n<li>“This is inconvenient, but it feels important.”</li>\n<li>“I’ve hit bottom, and I need help.”</li>\n<li>“This is a court mandate.”</li>\n</ul>\n<p>Beginnings are often messy.</p>\n<ul>\n<li>The first honest therapy session is rarely a “hell yes.”</li>\n<li>The first attempt at a new creative discipline can feel awkward and humbling.</li>\n<li>The first sober day, the first meditation class, the first awkward conversation with a partner about needs — none of that feels like fireworks.</li>\n</ul>\n<p>If “not a hell yes” automatically equals “no,” then anything that starts with curiosity instead of explosive certainty gets cut off before it has a chance to grow.</p>\n<h3>3. It Mistakes Dopamine for Destiny</h3>\n<p>There’s another problem: the human brain is wired to get high on novelty.</p>\n<p>The “hell yes” feeling can come from two very different places:</p>\n<ol>\n<li><strong>Grounded alignment</strong>\n<ul>\n<li>Calm but energized</li>\n<li>A feeling of expansion</li>\n<li>A quiet knowing: “This fits.”</li>\n</ul></li>\n<li><strong>Dopamine and drama</strong>\n<ul>\n<li>Intensity</li>\n<li>Obsession</li>\n<li>Fantasy</li>\n<li>The urge to move fast and not think too much</li>\n</ul></li>\n</ol>\n<p>One is a regulated yes. One is a dysregulated yes.</p>\n<p>The phrase “If it’s not a hell yes, it’s a no” does not differentiate between these.</p>\n<p>So, a person might:</p>\n<ul>\n<li>Say yes to chaotic relationships because they produce a “hell yes” chemical rush</li>\n<li>Say no to stable, emotionally safe people because they don’t feel like a movie</li>\n<li>Chase high-intensity jobs or projects that burn them out, but feel important because of the adrenaline</li>\n</ul>\n<p>Intensity is not the same as truth. Chaos is not the same as passion. Anxiety + attraction does not equal destiny.</p>\n<p>If the only yes allowed is “hell yes,” then life becomes a hunt for higher and higher spikes of stimulation… instead of a slow build of meaning.</p>\n<h2>A Better Question Than “Is This a Hell Yes?”</h2>\n<p>Instead of “hell yes or no,” try something more nuanced:</p>\n<blockquote><p>“Is this a grounded yes?”</p></blockquote>\n<p>A grounded yes includes two different checks:</p>\n<h3>1. A Yes in the Body</h3>\n<p>Before going to the mind’s story, tune into the body:</p>\n<ul>\n<li>Does this feel expansive or contracted?</li>\n<li>Is there a sense of calm energy or just anxiety and urgency?</li>\n<li>Does the idea of saying yes feel like relief or like self-betrayal?</li>\n</ul>\n<p>Grounded “yes” often feels like:</p>\n<ul>\n<li>Relaxed shoulders</li>\n<li>Fuller breath</li>\n<li>A sense of “this is a stretch, but I can grow into it.”</li>\n</ul>\n<p>Dysregulated “yes” often feels like:</p>\n<ul>\n<li>Tight chest</li>\n<li>Racing thoughts</li>\n<li>Urgency: “Say ‘yes’ now before it disappears!”</li>\n<li>Fear of missing out more than genuine desire</li>\n</ul>\n<h3>2. A Yes in the Values</h3>\n<p>Then ask:</p>\n<ul>\n<li>“Does this align with the kind of person I want to be?”</li>\n<li>“Is this consistent with my long-term goals, not just today’s mood?”</li>\n<li>“Would future-me say 'thank you' or 'why did you do that to us?’”</li>\n</ul>\n<p>A grounded yes is less about how loud the feeling is and more about what it’s rooted in.</p>\n<h2>A Simple 5-Question Framework for Real-Life Decisions</h2>\n<p>Instead of one catchy line, try filtering important decisions through these five questions:</p>\n<ol>\n<li><strong>Does this expand or contract me?</strong> Not “does this scare me,” but “does it ultimately expand my life, skills, heart, or possibilities?”</li>\n<li><strong>Is my attraction to this regulated or dysregulated?</strong> Does it feel like curiosity and energy, or like obsession and panic?</li>\n<li><strong>Am I saying yes out of desire or fear?</strong> Desire: “I want this because it matters to me.” Fear: “I’m saying yes so they don’t leave / so I’m not rejected / so I don’t feel guilty.”</li>\n<li><strong>Does future-me thank me for this?</strong> Picture yourself 6–12 months out. Is there a sense of gratitude for this decision, or a sense of “you knew better”?</li>\n<li><strong>Is this aligned with the life I’m building, not the life I’m escaping?</strong> Are you moving toward something you want, or away from discomfort?</li>\n</ol>\n<p>If at least three of these answers feel like solid yeses, it may be worth exploring — even if it isn’t a fireworks-level “hell yes.”</p>\n<h2>“No, for Now” Is Also an Option</h2>\n<p>Another hidden problem with “hell yes or no” is how absolute it sounds.</p>\n<p>Life is not a one-shot decision game. There’s a difference between:</p>\n<blockquote><p>“No, never” and “No, for now.”</p></blockquote>\n<p>Sometimes the wisest move is:</p>\n<ul>\n<li>“I don’t have enough information yet.”</li>\n<li>“My nervous system is too flooded to tell what’s true.”</li>\n<li>“I need more time and a few more data points.”</li>\n</ul>\n<p>That’s not indecision. That’s discernment.</p>\n<p>Pausing is different from avoiding. Waiting for more clarity is different from running away.</p>\n<h2>So… Is the Phrase Useless?</h2>\n<p>Not at all.</p>\n<p>“If it’s not a hell yes, it’s a no” can be:</p>\n<ul>\n<li>A training wheel for former people-pleasers learning to say no</li>\n<li>A temporary safeguard for those who chronically override their own needs</li>\n<li>A boundary tool for big life commitments that can’t be half-hearted</li>\n</ul>\n<p>The key is to recognize what it is:</p>\n<ul>\n<li>A blunt instrument, not a subtle one</li>\n<li>A seasonal tool, not a lifelong philosophy</li>\n<li>A starting point, not a final spiritual law</li>\n</ul>\n<p>Used wisely, it can interrupt reflexive yeses. Used blindly, it can block the slow, clumsy beginnings of the very life someone actually wants.</p>\n<h2>The Deeper Shift: From “Hell Yes” to Honest Yes</h2>\n<p>Most people don’t need more mantras.</p>\n<p>They need better questions, more honest self-inquiry, and a willingness to sit in the discomfort of “I don’t fully know yet.”</p>\n<p>The real work looks less like:</p>\n<blockquote><p>“If it’s not a hell yes, it’s a no.”</p></blockquote>\n<p>And more like:</p>\n<ul>\n<li>“What part of me is saying yes right now — my fear, my ego, or my heart?”</li>\n<li>“Where am I mistaking drama for depth?”</li>\n<li>“Am I protecting myself, or am I keeping my life small?”</li>\n<li>“Is this uncomfortable because it’s wrong for me, or because it asks me to grow?”</li>\n</ul>\n<p>Sometimes the bravest choice isn’t a “hell yes” or a “hard no.”</p>\n<p>Sometimes it’s a quiet, grounded:</p>\n<blockquote><p>“This scares me, and I’m willing to take one small step closer and see.”</p></blockquote>\n<p>That’s not as catchy on a poster. But it’s a lot closer to how real change, genuine intimacy, and meaningful work actually begin.</p>",
    "category": "Article",
    "tags": [
      "Mindfulness",
      "Relationships"
    ],
    "datePublished": "2026-02-22",
    "dateModified": "2026-02-22"
  },
  {
    "title": "Why Your Emotions Control What You See and How to Change Your Reality",
    "subtitle": "Tape measures and other affective items.",
    "author": "Michael Zick",
    "excerpt": "Feelings shape how we value objects, choose partners, and interpret reality. Mindfulness makes those hidden drivers visible so you can choose consciously instead of reacting on autopilot.",
    "canonicalUrl": "https://medium.com/hello-love/why-your-emotions-control-what-you-see-and-how-to-change-your-reality-0a01909d7cff",
    "canonicalSource": "Medium",
    "imageUrl": "https://miro.medium.com/v2/resize:fit:4800/format:webp/0*38ZT8SkbCe1m7s2R",
    "body": "<p>Was it the picture that caused you to click? Good. Analyze that.</p>\n<p>What feelings did it produce? Where in your body did you feel that sensation? Does the feeling feel good or bad?</p>\n<p>Did the feeling trigger any thoughts, judgements, or biases? Did you register the feeling at all?</p>\n<p>Why do you think I&#39;m asking these questions, and how do you feel about them?</p>\n<p>I&#39;m on my second listen of Why Buddhism Is True by Robert Wright. It&#39;s a book about Buddhist philosophy and how it applies to real life. It&#39;s also about the benefits and practical applications of mindfulness meditation.</p>\n<h2>About That Tape Measure</h2>\n<p>In Why Buddhism Is True, the author tells the tale of a hypothetical tape measure at an auction. The crowd is told that it belonged to JFK. What do you think that did for the value of a simple tape measure?</p>\n<p>The auction ensues and the tape measure goes to the highest bidder, except the winner is told that there was a mistake. The tape measure actually belonged to an unknown carpenter, and they&#39;ll send them JFK&#39;s tape measure later.</p>\n<p>What do you think happened to that tape measure&#39;s value in the eye of the auction winner? Or how about a Picasso that turns out to be a fake, or fool&#39;s gold thought to be real, or counterfeit diamonds, or even a cheap drink with an expensive label slapped on?</p>\n<p>Our perception of value usually comes from how we feel about it -- not its inherent utility.</p>\n<p>A fake Picasso has lost its value not because it didn&#39;t provide the same utility (after all, if it could pass as real, it looks like the original). It lost its value because the feeling associated with the original is what people would pay handsomely for.</p>\n<p>Think about it. If a fake Picasso and the real Picasso painting provides the same utility, yet only the original would fetch hundreds of thousands to over a million dollars, what actually makes it that valuable?</p>\n<p>The feeling of owning an original Picasso, and the open market value of other people&#39;s feelings of owning a real Picasso.</p>\n<h2>The Eye of the Beholder</h2>\n<p>While it can be said that humans have predictable attraction and relationship patterns, outliers do occur.</p>\n<p>For example, a young, highly attractive woman would likely seek a high value, high status man with abundant resources and an affluent lifestyle. No surprises there.</p>\n<p>And that same high value man would typically not settle for a woman he deems to be below his threshold for youth, beauty, and her ability to be sexually gratifying. You could say that these are biological drives that have been hard-wired into us by evolution, and I would agree.</p>\n<p>But what about the relationships that don&#39;t follow this predictable pattern?</p>\n<p>What if a couple seems mismatched in terms of looks, status, or income?</p>\n<p>What if their relationship leaves people secretly thinking, &quot;Can&#39;t so-and-so do better?&quot; Perhaps they can if personalities, childhoods, traumas, and self-awareness were entirely removed from the equation, but humans are highly complex.</p>\n<p>We end up with the people that make us feel the way we want to. Even if the script does run predictably, and the high status man does end up with the young, attractive woman. It can be said that feelings have played the main role there, too.</p>\n<p>It may be our storybook version of &quot;love,&quot; or it could be the feelings each partner gets from having the other at their side. The man could value the looks he gets from his high-status colleagues, and she could enjoy eliciting the cloaked envy of her peers.</p>\n<p>Perhaps she grew up in a lower middle class neighborhood and values the feeling of security her partner affords her. Perhaps he values the feeling of being with a woman who allows him to feel like he truly &quot;made it.&quot;</p>\n<p>Or, perhaps they both feel relaxed in the idea that they&#39;re with each others&#39; best possible option in the dating pool.</p>\n<h2>The Battle Within</h2>\n<p>Perhaps the most challenging aspect of dating and relating is the battle between our animal instincts, or what Wright refers to as &quot;natural selection,&quot; and our spiritual or conscious selves.</p>\n<p>The parts that believe in shared interests, compatibility, and the genuine enjoyment of each other&#39;s company.</p>\n<p>The question is always the same. Can a man forgo pure reproductive signals in a woman: youth, beauty, waist to hip ratio, height, and motherly temperament?</p>\n<p>And similarly, can a woman forgo signals from a man as a protector, provider, carrier of good genes, social status, height, and fatherly temperament?</p>\n<p>Can we bypass our drive to always search for our best possible option in favor of commitment, and that deeply misunderstood emotion, &quot;love?&quot;</p>\n<p>What we&#39;ve been calling &quot;falling in love&quot; is one of the most powerful feelings in which decisions, good and bad, have been based on.</p>\n<p>Vegas weddings after dating for three weeks. Expenditures of money, time, and resources. Long trips to be together, and a host of other story-worthy endeavors, all accomplished on the cloud of &quot;love.&quot;</p>\n<p>We now understand this early stage of emotion as &quot;limerence,&quot; and after a relationship has solidified, we&#39;ve come to understand that next feeling as &quot;attachment.&quot;</p>\n<p>Real love remains a mystery, particularly the &quot;true love&quot; spoken about in romance novels and movies. By and large, it&#39;s usually portrayed as one&#39;s valuing someone else&#39;s life more than our own, and it typically involves some heroic sacrifice.</p>\n<p>Jack&#39;s decision to put Rose on the flotation device while he descends to the icy depths as a human icicle.</p>\n<p>If that&#39;s the case, then &quot;true love&quot; is far more temporary than we thought. However, some movies portray true love as something that lasts until old age, and no one sees the conflicts, the arguments, and the struggles that take place between the falling in love and the growing old together.</p>\n<p>On the flip side, feelings of disgust, anger, resentment, pity, and a host of other emotions can present another danger: the dissolution of relationships at any stage.</p>\n<p>Internal triggers, preferences, conflicting love languages, attachment styles, and communication styles to name a few. Once a beloved partner, a person can slowly turn into the annoying roommate in a relationship where sex has dried up and the feelings of being in love are replaced with a wall of bitterness and contempt.</p>\n<p>How do people who were so in love get there? Feelings got them there. The same mechanism that built the relationship eventually dismantled it.</p>\n<h2>Spiritual Animals</h2>\n<p>Spirituality, in many ways, as Wright points out in Why Buddhism Is True, is the bypassing of biological programming in favor of a more conscious path. For almost two decades we&#39;ve had social media and dating apps, plus the internet&#39;s global reach in finding newer and newer partners.</p>\n<p>And that global reach has made the battle between our biology and our consciousness that much harder to win.</p>\n<p>Natural selection doesn&#39;t care about your relationship. It cares about replication. It cares about novelty. It cares about spreading genes as widely and effectively as possible.</p>\n<p>Every swipe on a dating app is a small hit of dopamine, a tiny signal from your biology saying, &quot;There might be a better option out there.&quot; And in a world where options are literally endless, that signal never shuts off.</p>\n<p>This is where spirituality, or at the very least mindfulness, becomes useful. Not in the way that many people misuse it, though.</p>\n<p>There&#39;s a version of &quot;spiritual growth&quot; that&#39;s really just a dressed-up form of self-victimization, where a person convinces themselves that because they&#39;ve meditated a few times and read a couple of books, they&#39;ve somehow transcended their human nature.</p>\n<p>That they&#39;re &quot;above&quot; their biological drives, and anyone who hasn&#39;t reached their level of enlightenment is operating on a lower frequency.</p>\n<p>That&#39;s not what this is about. That kind of thinking is just as unconscious as blindly following your impulses. It&#39;s the ego wearing a spiritual costume.</p>\n<p>What Wright and Buddhist philosophy actually point to is something far more practical. It&#39;s the ability to notice.</p>\n<p>To notice that you felt a surge of attraction and to pause before acting on it.</p>\n<p>To notice that you&#39;re angry at your partner and to recognize that the anger may be rooted in something from your childhood rather than what they just said.</p>\n<p>To notice that you&#39;ve been scanning dating apps not because your relationship is failing, but because your biology is restless and looking for novelty.</p>\n<p>The key word there is &quot;notice.&quot;</p>\n<p>Not suppress. Not judge. Not override your biology and become some passionless, detached version of yourself. That&#39;s what a lot of people get wrong. They hear &quot;spiritual growth&quot; and think it means becoming a pushover.</p>\n<p>Becoming the person who never asserts themselves, never wants anything, never competes. That&#39;s not consciousness. That&#39;s just a different form of unconsciousness, one where a person has swung so far from their animal instincts that they&#39;ve abandoned their own needs entirely.</p>\n<p>I see this constantly in my work. Men who&#39;ve spent years people-pleasing, avoiding conflict, and suppressing their own desires because they believed that being &quot;nice&quot; was the path to love and approval.</p>\n<p>What they really did was abandon themselves. And when they discover that this pattern hasn&#39;t been serving them, the temptation is to swing to the other extreme, to become cold, strategic, transactional, or exit the dating marketplace entirely.</p>\n<p>While the latter may seem like consciousness at play, much of it is still driven by emotion. Disney visions of love are replaced with anger, bitterness, and resentment.</p>\n<p>The real work, and I mean the actual difficult, unglamorous, daily work, is in developing an acute awareness of what&#39;s driving you in any given moment.</p>\n<p>Is this decision coming from your biology? From a wound? From contempt? From genuine clarity? And once you&#39;ve identified the source, you get to choose. Not react. Choose.</p>\n<p>That&#39;s the difference. A man who understands his biological pull toward youth and beauty doesn&#39;t have to shame himself for it.</p>\n<p>And a woman who understands her pull toward status and security doesn&#39;t have to shame herself for it either.</p>\n<p>Both drives are equally hardwired, equally valid, and equally capable of leading someone somewhere they don&#39;t actually want to go if left unexamined. The point isn&#39;t that one drive is noble and the other is shallow.</p>\n<p>The point is that neither drive has to run the show.</p>\n<p>Spirituality, when it&#39;s practiced honestly, doesn&#39;t ask you to kill your instincts. It asks you to stop being unconscious about them. And the moment you bring awareness to an impulse, it loses a significant amount of its power over you.</p>\n<p>Not all of it. You&#39;re still human. But enough that you can make a decision rather than simply being carried along by a feeling. And it also means being ruthlessly honest about when you&#39;re using spirituality as a shield.</p>\n<p>When &quot;I&#39;m just on a higher frequency&quot; is really code for &quot;I&#39;m afraid of not being enough.&quot;</p>\n<p>When &quot;I don&#39;t need a relationship to be happy&quot; is really code for &quot;I&#39;ve given up.&quot;</p>\n<p>When &quot;I&#39;m focused on my spiritual journey&quot; is really code for &quot;I&#39;m avoiding the hard work of intimacy.&quot;</p>\n<p>Awareness has to include awareness of your own self-deception, or it&#39;s just another blind spot wearing a nicer outfit.</p>\n<h2>Conclusion</h2>\n<p>If you zoom out far enough, you start to see that humans don&#39;t just have feelings, we form entire identities around them. We build patterns of emotional experience that we return to again and again because they feel familiar.</p>\n<p>And familiar doesn&#39;t mean good. It means known.</p>\n<p>The person who grew up feeling like a failure will unconsciously seek out situations that confirm that feeling.</p>\n<p>They&#39;ll sabotage a promotion. They&#39;ll pick a partner who makes them feel small. They&#39;ll interpret neutral events as evidence that they&#39;re not enough.</p>\n<p>Not because they want to feel like a failure, but because that feeling is home. It&#39;s the emotional state their nervous system learned to organize around, and the body will return to what it knows, even when what it knows is painful.</p>\n<p>The same is true on the other end. Someone who grew up feeling like a leader, like someone who wins, will seek out situations that reinforce that identity.</p>\n<p>They&#39;ll take risks. They&#39;ll compete. They&#39;ll frame setbacks as temporary. The feeling of winning is their baseline, and their decisions will orient around protecting it.</p>\n<p>This is where the tape measure and the Picasso and the relationships all connect.</p>\n<p>The value we assign to things, to people, to experiences, is rarely about the thing itself. It&#39;s about the feeling the thing produces in us, and whether that feeling matches the identity we&#39;ve built for ourselves.</p>\n<p>A man doesn&#39;t just choose a partner. He chooses the feeling that partner gives him, and whether that feeling aligns with who he believes himself to be.</p>\n<p>A woman doesn&#39;t just fall in love. She falls into a feeling, and that feeling either confirms or disrupts the emotional identity she&#39;s been carrying since childhood.</p>\n<p>This is why two people can look at the same relationship and see completely different things. One person sees security. The other sees a cage. One person sees passion. The other sees chaos. Same relationship, different feeling identities interpreting it.</p>\n<p>And this is why the work of becoming conscious, of practicing mindfulness, of examining your biological and emotional programming, matters so much.</p>\n<p>Because if you don&#39;t know what feeling you&#39;re chasing, you can&#39;t know why you&#39;re making the choices you&#39;re making.</p>\n<p>You&#39;ll think you&#39;re choosing a partner when you&#39;re really choosing a feeling. You&#39;ll think you&#39;re building a career when you&#39;re really trying to prove something to a parent who never acknowledged you.</p>\n<p>You&#39;ll think you&#39;re pursuing happiness when you&#39;re really just trying to return to a familiar emotional state, even if that state is suffering.</p>\n<p>The feelings came first. They always do. The tape measure&#39;s value was never about the tape measure. The Picasso&#39;s value is less about the painting and more about the feeling of owning it.</p>\n<p>And your life&#39;s direction has little to do with the things you think it&#39;s about.</p>\n<p>And once you see that clearly, once you truly register it in your body the same way I asked you to at the top of this post, you gain something that most people never access: the ability to choose among the feelings.</p>",
    "category": "Article",
    "tags": [
      "Emotions",
      "Mindfulness",
      "Perception",
      "Relationships"
    ],
    "datePublished": "2026-02-17",
    "dateModified": "2026-02-17"
  },
  {
    "title": "The Music of Enmeshment",
    "subtitle": "When a child sings like an adult, all the songs are sad.",
    "author": "Michael Zick",
    "excerpt": "Enmeshment can feel like purpose while it quietly erodes identity. This story traces adultification, emotional incest, and the long recovery back to self.",
    "canonicalUrl": "https://medium.com/hello-love/the-music-of-enmeshment-a1a8fa35aa3d",
    "canonicalSource": "Medium",
    "imageUrl": "https://miro.medium.com/v2/resize:fit:4800/format:webp/0*EzSSwY4UXhm_dge_",
    "body": "<p>&ldquo;If you learn to play The Blues, I&apos;ll buy you a new guitar,&rdquo; said my mother.</p>\n<p>I was around 15, maybe 16, and into bands like Pantera and Rage Against the Machine.</p>\n<p>But I learned to play The Blues.</p>\n<p>I played it in smoky bars and at small-town festivals, and became well-known for my Blues licks as well as my drumming and music video editing.</p>\n<p>I was a hell of a creative kid, but I hated myself.</p>\n<p>And just like always, I took the bait.</p>\n<p>Dr. Robert Glover calls it &ldquo;monogamy to mom.&rdquo; Dr. Patricia Love calls it &ldquo;the emotional incest syndrome.&rdquo; However you slice it, enmeshment is enmeshment.</p>\n<p>This is how it played out in my life.</p>\n<h2>The Split</h2>\n<p>When I was around seven, my parents separated.</p>\n<p>We moved from upstate New York to Arizona. My mom was sick of the cold and wanted to return to the warmth she grew up with. I went with her, and my dad was supposed to follow.</p>\n<p>He didn&apos;t (for reasons I won&apos;t go into here).</p>\n<p>What was meant to be temporary turned into a divorce three years later. But in the meantime, something covert and insidious happened:</p>\n<p>I became my mom&apos;s surrogate spouse.</p>\n<p>Not physically. Emotionally.</p>\n<p>I became responsible for holding her rage, pain, and unmet needs that were supposed to be held by an adult partner. In the absence of my father, she turned me into the &ldquo;man of the house,&rdquo; often bragging to her friends that I was &ldquo;7 going on 17.&rdquo;</p>\n<p>I thought it was a compliment. I thought it meant I was special.</p>\n<p>And I was, but not in the way I thought.</p>\n<h2>When Being a Kid Isn&apos;t Allowed</h2>\n<p>Imperfection wasn&apos;t tolerated.</p>\n<p>It was &ldquo;Perform like an adult.&rdquo;</p>\n<p>&ldquo;Act like an adult.&rdquo;</p>\n<p>&ldquo;Write like an adult.&rdquo;</p>\n<p>&ldquo;Be there for me like an adult.&rdquo;</p>\n<p>We call this, unsurprisingly, &ldquo;adultification.&rdquo;</p>\n<p>I was expected to skip over the kid stage and be &ldquo;better&rdquo; than all the other children, as if reaching adulthood was a competition.</p>\n<p>I was expected to set aside my childhood to be there for Mom &mdash; to be flawless for Mom. Trouble-free and validating. An emblem of parenting done right.</p>\n<p>And to be fair, it didn&apos;t start at seven.</p>\n<p>Before the separation, I was introduced to S.H.A.M.E. &mdash; Should Have Already Mastered Everything.</p>\n<p>I remember changing sparkplugs, holding the flashlight steady, and untangling fishing line.</p>\n<p>Most small tasks required perfection or the punishment was severe.</p>\n<p>So I learned early:</p>\n<p>Being a child wasn&apos;t okay.</p>\n<p>Mistakes weren&apos;t tolerable.</p>\n<p>Adult-level performance was the only &ldquo;safe&rdquo; way to exist.</p>\n<p>It hurts to write that, even after all these years.</p>\n<p>My parents were essentially children themselves with the responsibilities of adults. They carried their own emotional scarring and their own adultification wounds.</p>\n<p>That doesn&apos;t excuse anything, but it does explain the pattern.</p>\n<h2>Enmeshment and the Uncomfortable Word</h2>\n<p>Approaching middle age, deep into my 12-Step work, I finally had language for what happened with my mom:</p>\n<p>Emotional incest. Also known as &ldquo;covert incest.&rdquo;</p>\n<p>The word incest is strong. It makes people recoil. And honestly, it should.</p>\n<p>It&apos;s an uncomfortable term, but this isn&apos;t a sugar-coated story.</p>\n<p>It&apos;s reality, and the reality of situations like this isn&apos;t pretty.</p>\n<h2>The Cost</h2>\n<p>Once I became my mom&apos;s emotional support system and whipping boy for her rage, I lost something fundamental:</p>\n<p>My internal compass.</p>\n<p>I lost my sense of self. I became a shell whose job was to please Mom.</p>\n<p>From the outside, my childhood still looked normal in some ways.</p>\n<p>I did boy things:</p>\n<ul>\n<li>Rode bikes and skateboards</li>\n<li>Collected He-Man and G.I. Joe toys</li>\n<li>Played with Hot Wheels and Micro Machines</li>\n<li>Shot rocks out of homemade slingshots</li>\n<li>Played a little baseball</li>\n<li>Occasionally got into a fight or toilet-papered a house</li>\n<li>Later, after hearing Metallica, I fell in love with Metal and started playing guitar.</li>\n</ul>\n<p>And eventually&hellip;that got taken over too.</p>\n<h2>The Jackpot</h2>\n<p>From about seven to thirteen, I was Mom&apos;s little man.</p>\n<p>And here&apos;s the twist: I didn&apos;t know it was dangerous.</p>\n<p>I thought I won the jackpot.</p>\n<p>I had Mom all to myself. I felt like I had rescued her from the chaos of the marriage. I saw myself as special, chosen, a redeemer.</p>\n<p>I willingly took on the responsibility of listening to her, validating her, becoming who she needed me to be, and casting aside who I was to keep things stable.</p>\n<p>I didn&apos;t know who I was, but I thought I was a god.</p>\n<p>This is where enmeshment is seductive. It doesn&apos;t feel like abuse while it&apos;s happening. It feels like purpose, meaning, and love.</p>\n<p>It feels like a drug.</p>\n<h2>Whose Dream Was It Anyway?</h2>\n<p>As I approached sixth grade, I wanted to be a scientist. A marine biologist, maybe.</p>\n<p>But my mom wanted me to be a rockstar.</p>\n<p>So when music became my number one passion, and I showed real talent, she didn&apos;t just support it. She looked for ways to control it.</p>\n<p>Her abandonment issues surfaced. The long, dark arm of emotional manipulation rose to direct my music life, and I let her.</p>\n<p>Once again, my &ldquo;mission&rdquo; became: Ignore self-direction. Gain Mom&apos;s approval.</p>\n<p>And later, if I&apos;m being honest, this generalized into women&apos;s approval.</p>\n<h2>The Pattern It Created</h2>\n<p>One of the most insidious outcomes of enmeshment is what it does to your relationship with steadiness.</p>\n<p>It trained me to equate intensity with truth.</p>\n<p>So my life became a repeating cycle:</p>\n<ul>\n<li>Rapid adoption and escalation</li>\n<li>A rush of meaning, identity, and &ldquo;This is it.&rdquo;</li>\n<li>Emotional drop-off</li>\n<li>Boredom and detachment</li>\n<li>Exit</li>\n</ul>\n<p>This showed up everywhere.</p>\n<h3>Careers</h3>\n<p>I jumped from path to path. First from music style to music style, then musician/composer to recording engineer.</p>\n<p>Then real estate.</p>\n<p>Then IT.</p>\n<p>Then back to recording and composing.</p>\n<p>Then web development.</p>\n<p>Then coaching.</p>\n<p>Then back to web development (though I kept coaching as a side gig).</p>\n<p>I sabotaged success at every turn because everything felt real at first &mdash; exciting, electric, and passionate.</p>\n<p>Then wrong, when the anxiety and novelty wore off, and things became work.</p>\n<p>After two to four years, anything I was doing started to feel like a slog. And I&apos;d interpret that slog as evidence I was on the wrong path.</p>\n<h3>Relationships</h3>\n<p>Same template.</p>\n<p>The &ldquo;jolt&rdquo; of enmeshment made stable relationships feel flat and uninteresting. Commitment felt like boredom. Calm felt like a sign I was settling.</p>\n<p>In other words:</p>\n<p><strong>intensity = love</strong></p>\n<p><strong>steadiness = something is horribly wrong</strong></p>\n<p>That&apos;s not to say that relationships don&apos;t require work to keep the spark alive; it&apos;s that I re-enacted the pattern of unavailability (Dad) and enmeshment (Mom).</p>\n<p>I&apos;d engage, get high on limerence and chaos, and when things began to stabilize, find someone new to repeat the cycle with.</p>\n<h2>Recovery</h2>\n<p>I came into adulthood as an adult child, loaded with:</p>\n<ul>\n<li>Codependency</li>\n<li>People-pleasing</li>\n<li>Fear and anxiety</li>\n<li>Low self-worth</li>\n<li>Toxic shame</li>\n</ul>\n<p>The most meaningful work I&apos;ve done since entering recovery in 2015 is this:</p>\n<ul>\n<li>Getting in touch with the pain of enmeshment</li>\n<li>Letting it move through me instead of managing it</li>\n<li>Discovering who I am underneath all the coping and false selves</li>\n</ul>\n<p>I&apos;ve got a long way to go, but I&apos;ve made real progress integrating the parts of myself I was afraid of, and parts I didn&apos;t even know existed.</p>\n<p>Though my nervous system was programmed to seek outside validation to regulate, I&apos;ve begun to feel less needy.</p>\n<p>I&apos;ve gotten less sensitive to rejection, though my mind still jumps to worst-case scenarios.</p>\n<p>Though I&apos;m tempted to outsource my worth to unavailable people, I&apos;ve learned to set better boundaries and work through fears of abandonment.</p>\n<p>And because my compass still feels like it&apos;s missing pieces, I need constant reminders that this is an inside job and no woman is responsible for completing me.</p>\n<p>And it is not my responsibility to complete her, either.</p>\n<h2>Toxic Shame</h2>\n<p>Above all, I know now that the core driver is toxic shame.</p>\n<p>Not healthy shame. Not conscience. Not accountability.</p>\n<p>I mean that deep, inherited, corrosive belief that something is fundamentally wrong with me, and everything I do will turn to shit.</p>\n<p>I have to let go of what was handed down and keep walking the path of self-discovery.</p>\n<p>I also know something else that&apos;s hard to admit:</p>\n<p>I have to experience Hell to leave it.</p>\n<p>Not to live there forever. Not to romanticize suffering, but to integrate it as part of a 360-degree acceptance of my story.</p>\n<p>I can&apos;t recreate my childhood and get that time back, but I can fill the needs that weren&apos;t met in mature and healthy ways.</p>\n<p>I can learn to cultivate a positive self-image and face the fear of uncertainty.</p>\n<p>Maybe things will work out the way I think they will. Maybe worse; maybe better.</p>\n<p>All I can do is the work.</p>\n<p>The rest is not up to me.</p>\n<h2>Music</h2>\n<p>Today, I listen to music when I feel like it, but I mostly listen to self-development audiobooks.</p>\n<p>When I look at my guitar, I see an instrument I&apos;m relatively good at (when I practice), but also a validation vehicle that was used to fuel someone else&apos;s dream.</p>\n<p>In a way, I feel robbed, but I also feel blessed to be able to write and share my story.</p>\n<p>I&apos;ve heard enough sad songs to know I&apos;m not alone.</p>",
    "category": "Article",
    "tags": [
      "Enmeshment",
      "Adultification",
      "Shame",
      "Recovery"
    ],
    "datePublished": "2026-02-05",
    "dateModified": "2026-02-05"
  },
  {
    "title": "The Survival Instincts Making You Miserable in Modern Relationships",
    "subtitle": "Stop treating thoughts and feelings as facts.",
    "author": "Michael Zick",
    "excerpt": "Our brains are still wired for hunter-gatherer survival, leading to cognitive distortions like mind-reading, catastrophizing, and comparison. Learn how to separate truth from falsehood and escape the misery of primitive instinct in modern relationships.",
    "canonicalUrl": "https://medium.com/hello-love/the-survival-instincts-making-you-miserable-in-modern-relationships-b6a9dde19c50",
    "canonicalSource": "Medium",
    "imageUrl": "https://miro.medium.com/v2/resize:fit:4800/format:webp/0*__0Tu1lOEMIRe3RN",
    "body": "<p>&ldquo;I know what she&rsquo;s thinking,&rdquo; I thought to myself.</p>\n<p>&ldquo;She thinks I&rsquo;m a loser.&rdquo;</p>\n<p>&ldquo;I need to hurry up and impress her before she gets bored and walks away. Quick. Say something clever.&rdquo;</p>\n<p>Have you been there? Or how about:</p>\n<p>&ldquo;They&rsquo;re probably talking about how amazing I am and how well I crushed that project. I bet they&rsquo;re discussing my promotion right now. I&rsquo;m gonna be sooo promoted.</p>\n<p>Wait. No I&rsquo;m not. Why would they promote me? I&rsquo;m the least talented person on the team. Are they gonna let me go? My boss looked at his watch while I was talking. They&rsquo;re totally gonna let me go.&rdquo;</p>\n<p>Or this:</p>\n<p>&ldquo;My best friend has all the luck. Look at him and his new house and picture-perfect family all over Instagram, getting way more likes than me. Screw them.</p>\n<p>Maybe I should just unfollow them and go do something amazing so I&rsquo;ll never feel this way again. I won&rsquo;t just be as happy as him &mdash; I&rsquo;ll be happier.&rdquo;</p>\n<p>Or this?</p>\n<p>&ldquo;I sent over 300 job applications and only had one interview. That&rsquo;s it. I&rsquo;m un-hirable. My work history sucks and I&rsquo;m never going to get hired in this field again.</p>\n<p>Why don&rsquo;t I quit and become a pizza delivery person or work at Starbucks? No &mdash; eventually robots are going to take those jobs and I&rsquo;ll be homeless. That&rsquo;s it. I&rsquo;m 100% destined to be homeless.&rdquo;</p>\n<p>Any of these sound like you?</p>\n<p>These are just a few examples of what psychologists call cognitive distortions.</p>\n<p>Rooted in the survival part of our brain, comparing ourselves to others, pretending we can read minds, thinking we &ldquo;should&rdquo; or &ldquo;shouldn&rsquo;t&rdquo; do something, jumping to conclusions, and catastrophizing are manifestations of anxiety often rooted in childhood.</p>\n<p>While the human brain is wired for survival regardless of environment, unpredictable, chaotic, or abusive childhoods exacerbate and amplify these survival instincts, leading to a sensitive and reactive amygdala &mdash; the part of the brain that sends us into action or reaction before we have time to think.</p>\n<h2>Threat Detection and Response</h2>\n<p>Despite our technological advances, our brains are still wired for hunter-gatherer survival. We form tribes, define hierarchies, acquire food, land, and resources, defend what&rsquo;s ours, and reproduce.</p>\n<p>We haven&rsquo;t drifted far from the tribal instincts and brain functions that once protected us from death by starvation, conflict, or exile, and propelled us to propagate our species. At our core, we&rsquo;re wired to be consumed with thoughts about food, status, sex, and death.</p>\n<p>In our preverbal years, our nervous systems became attuned to our primary caregivers and developed strategies to best get our needs met within that system. For many of us, that system was less than optimal. As a result, we developed anxiety patterns and behavioral strategies that ensured survival.</p>\n<p>These strategies formed our relational blueprint and primary modes of conduct when threats were detected (or imagined). These are fight, flight, freeze, and fawn.</p>\n<p>Below are high-level descriptions of each.</p>\n<h3>Fight</h3>\n<p>While the bully or the person quick to enter altercations may be seen as courageous or fearless, this behavior is usually a response to anxiety. This person developed a coping strategy that involved defending themselves when threatened, often leading others to see them as a &ldquo;loose cannon&rdquo; or volatile.</p>\n<p>A telltale sign that someone&rsquo;s fear response is fight is when those around them cannot see a real threat, yet this person feels compelled to defend against even the slightest infringement on territory, status, resources, or mate.</p>\n<h3>Flight</h3>\n<p>This strategy tells the brain and body to do one thing immediately: run.</p>\n<p>Often seen in people who abandon relationships at the slightest provocation or conflict, those prone to flight avoid altercations by avoiding the situation altogether.</p>\n<p>It&rsquo;s common to see relationships where one person employs a fight response while the other employs flight, creating a chase-and-flee dynamic, followed by the high of reconciliation.</p>\n<h3>Freeze</h3>\n<p>This response is essentially a shutdown in the face of a real or perceived threat.</p>\n<p>Unlike fight or flight, the person who freezes stays in the vicinity of the conflict but withdraws internally and hopes the threat will disappear.</p>\n<p>Like a turtle withdrawing into its shell, the freeze responder learned that doing nothing was the best way to stay safe when threatened.</p>\n<h3>Fawn</h3>\n<p>This strategy attempts to neutralize the threat by appeasing the &ldquo;attacker,&rdquo; and it&rsquo;s the one I identify with most.</p>\n<p>Often used by Nice Guys (and women), the person who fawns seeks safety by &ldquo;joining the enemy,&rdquo; taking all of the blame, or abandoning their own opinions, views, or values in hopes the threat will dissolve through agreement.</p>\n<p>Other names for this behavior include &ldquo;becoming small&rdquo; or &ldquo;being a doormat&rdquo; &mdash; often followed by an eventual explosion of rage once resentments pile up, aka the &ldquo;exploding doormat.&rdquo;</p>\n<p>In our ancestral tribes, perceived threats were real threats to survival.</p>\n<p>Lower status could mean fewer resources for ourselves or our families. It could lead to exile, which almost certainly meant death.</p>\n<p>Lower status also meant less protection and reduced access to mates, lowering reproductive opportunity. Higher mate value meant stronger offspring and more resources, leading to a stronger tribe.</p>\n<p>Today, food is so plentiful that we worry more about overconsumption than survival. Mate value is often associated with fitness, while displays of resources show up as expensive cars, jewelry, travel, or even maintaining a tan year-round.</p>\n<p>Where our ancestors lived in huts, modern humans equate massive houses, excess wealth, and fame with success.</p>\n<p>Despite our evolution, we&rsquo;re still bound by the same tribal survival instincts &mdash; instincts forged when resources were scarce, threats were constant, and a drop in status or tribal acceptance could mean death for us and those we loved.</p>\n<p>In other words, our anxiety was once rooted in reality.</p>\n<p>What&rsquo;s also interesting, is that fame or an elevated status can make someone less safe, as criminals often target celebrities or wealthy individuals. However, the drive to acquire an excess of status and resources is seen in almost every culture.</p>\n<h2>&ldquo;But it feels real&hellip;&rdquo;</h2>\n<p>While we place warning labels on chemicals and use childproof containers for prescription drugs, we do very little to warn ourselves about incoming thoughts and emotions.</p>\n<p>Most of us grow up treating feelings as facts and acting on them as if they&rsquo;re instructions for living.</p>\n<p>Anger, rage, jealousy, sadness, rejection, and fantasy-based happiness are powerful emotions that can dramatically affect employment, romantic relationships, and families.</p>\n<p>Very few of us stop to question whether these thoughts and feelings are based on reality because they feel real. They feel as if the threat is going to consume us, kill us, or get us banished from the tribe.</p>\n<p>Cognitive distortions are a byproduct of an alarm system that was designed to keep us safe, but keeps us stuck in a loop of falsehood.</p>\n<p>Here is a list of common cognitive distortions:</p>\n<ol>\n<li><strong>All-or-Nothing Thinking</strong>: Seeing things in extremes, e.g. &ldquo;If it&rsquo;s not perfect, it&rsquo;s a failure.&rdquo;</li>\n<li><strong>Overgeneralization</strong>: One event defines a pattern, e.g. &ldquo;This always happens to me.&rdquo;</li>\n<li><strong>Mental Filter</strong>: Focusing only on the negative. One flaw outweighs everything else.</li>\n<li><strong>Disqualifying the Positive</strong>: Rejecting good things, e.g. &ldquo;That win doesn&rsquo;t count.&rdquo;</li>\n<li><strong>Jumping to Conclusions</strong>\n<ul>\n<li>Mind Reading: &ldquo;I know what they think.&rdquo;</li>\n<li>Fortune Telling: &ldquo;I know how this ends.&rdquo;</li>\n</ul>\n</li>\n<li><strong>Magnification/Minimization</strong>: Exaggerating negatives or shrinking positives.</li>\n<li><strong>Emotional Reasoning</strong>: Feelings equal facts, e.g. &ldquo;I feel it, so it must be true.&rdquo;</li>\n<li><strong>&ldquo;Should&rdquo; Statements</strong>: Rigid rules, e.g. &ldquo;I should be further along.&rdquo;</li>\n<li><strong>Labeling &amp; Mislabeling</strong>: Turning actions and emotions into identities, e.g. &ldquo;I&rsquo;m a failure.&rdquo;</li>\n<li><strong>Personalization</strong>: Taking responsibility for things outside your control.</li>\n<li><strong>Blame</strong>: Assigning fault while ignoring your role.</li>\n<li><strong>Catastrophizing</strong>: Expecting the worst-case scenario.</li>\n<li><strong>Control Fallacies</strong>\n<ul>\n<li>External: Life happens to me.</li>\n<li>Internal: Everything is my fault.</li>\n</ul>\n</li>\n<li><strong>Fallacy of Fairness</strong>: Life should match your expectations.</li>\n<li><strong>Heaven&rsquo;s Reward Fallacy</strong>: Suffering guarantees payoff.</li>\n<li><strong>Being Right</strong>: Needing correctness at all costs.</li>\n<li><strong>Comparison Filtering</strong>: Measuring your worth against others.</li>\n</ol>\n<h2>The Roots of Suffering</h2>\n<p>I don&rsquo;t claim to be a Buddhist or an authority on enlightenment, but through my studies I&rsquo;ve come to see how our attachment to tribal drives becomes a root of suffering in modern life.</p>\n<p>We get upset when a friend buys a bigger house. When a neighbor drives a nicer car or has a more attractive partner.</p>\n<p>We think a promotion will finally make us happy, until the feeling fades a day later and we&rsquo;re left wanting more.</p>\n<p>Social media fuels a global epidemic of discontentment by turning life into a comparison contest where others appear to live better lives because they only post highlights.</p>\n<p>Our primitive survival mechanisms tell us we&rsquo;re not enough, that we&rsquo;ll be left behind, that we&rsquo;ll cease to exist in the dating or status marketplace.</p>\n<p>We fear a drop in status, and so we compulsively acquire more &mdash; even when we already have more than enough to survive.</p>\n<h2>A Different Path Forward</h2>\n<p>Freedom from self-inflicted suffering, as I see it, is not in the acquisition of &ldquo;more,&rdquo; but learning to be content with what we have and recognizing that many economic and social systems exploit our tribal wiring for profit.</p>\n<p>When paired with unstable or abusive childhoods, our protective amygdala can turn cognitive distortions up to eleven, increasing suffering through protection mechanisms gone awry.</p>\n<p>I&rsquo;m not saying all ambition is wrong; wanting security and a high quality of life for ourselves and our families is healthy. But excess driven by cognitive distortions, rather than genuine need, is where suffering multiplies, while reality provides relief.</p>\n<p>Furthermore, continuously questioning our thoughts and emotions and treating them as information to be fact-checked, can also lead to serenity and greater success in relationships.</p>\n<h2>Tools and Techniques</h2>\n<p>Mindfulness meditation, journaling, talking things out, and spending time in nature are my favorite techniques to calm the nervous system and get back to baseline.</p>\n<p>Ironically, when I put myself in physically challenging situations and make it out alive, all of the nagging thoughts and fears fade into the background where they lose most of their power. Science has documented the power of the flow state, which is characterized by full immersion in the present.</p>\n<p>Meditation, on the other hand, teaches the body that not every perceived threat requires action. In fact, hardly any of them do. Taking a 20-minute walk when a confrontation gets heated is a well-known way to turn off the alarm system and re-engage with clarity.</p>\n<p>Different traditions describe this state of attunement to reality in different ways. Buddhists call it &ldquo;Dharma.&rdquo; Dr. David R. Hawkins, author of books like &ldquo;Transcending the Levels of Consciousness,&rdquo; calls it &ldquo;separating truth from falsehood.&rdquo; In the movie The Matrix, it&rsquo;s called &ldquo;taking the red pill.&rdquo;</p>\n<p>What works varies from person to person. Some find therapy or coaching essential, while others need body-based practices like yoga, martial arts, or action sports like surfing. Many, like myself, find benefit from a combination.</p>\n<h2>Conclusion</h2>\n<p>While we may never eradicate all erroneous thoughts or feelings or erase our tribal nature, we can develop awareness, grounding, and discernment, allowing us to separate truth from fear and live a life where enough truly is enough.</p>\n<p>When we stop taking our thoughts and feelings at face value or as a sign that action is required, we can re-train our nervous systems. Fight, flight, freeze, and fawn can be seen for what they are: threat responses rooted in tribal physical survival. And while an Instagram post may feel like life or death, it&rsquo;s our perceptions and triggers that are at play.</p>\n<p>So remember this: just because someone has something &ldquo;better&rdquo; does not mean you&rsquo;ll be any happier if you get it. What&rsquo;s right for some may not be right for you, and there&rsquo;s no telling what burdens come with fulfilling that desire.</p>\n<p>Anxiety and cognitive distortions oversimplify reality in exchange for the immediacy of action, ignoring the nuances that might actually set us free.</p>",
    "category": "Article",
    "tags": [
      "Relationships",
      "Survival Instincts",
      "Cognitive Distortions",
      "Anxiety",
      "Mindfulness"
    ],
    "datePublished": "2026-01-13",
    "dateModified": "2026-01-13"
  },
  {
    "title": "The Nice Guy Trap Isn't \"Being Nice.\" It's These 4 Patterns.",
    "subtitle": "Most people miss the fourth one, it's why nothing changes.",
    "author": "Michael Zick",
    "excerpt": "The Nice Guy trap isn't kindness — it's fear. These four patterns keep men stuck in performance, anxiety, and resentment until they face what's running the system.",
    "canonicalUrl": "https://medium.com/hello-love/the-nice-guy-trap-isnt-being-nice-it-s-these-4-patterns-0f22c411dff6",
    "canonicalSource": "Medium",
    "imageUrl": "https://miro.medium.com/v2/resize:fit:2000/0*B45atecjzNHrUOzp",
    "body": "<p>He says, &quot;No worries!&quot;</p>\n<p>But his stomach drops when she takes longer than 30 minutes to reply.</p>\n<p>He smiles, nods, asks her questions, tells her she's amazing, offers to help with her move, and stays &quot;chill.&quot;</p>\n<p>Then he goes home and replays every micro-expression like he's doing forensic analysis for the FBI.</p>\n<p>This is the part people miss about the Nice Guy. It's not that he's nice, it's that he's scared. And he's learned to hide that fear behind a persona that looks like kindness, selflessness, going with the flow, and service.</p>\n<p>Dr. Robert Glover's book <em>No More Mr. Nice Guy</em> has been a gateway for a lot of men. It puts language to a pattern that feels painfully familiar: approval-seeking, conflict avoidance, indirectness, resentment, covert contracts, and the &quot;I'm fine&quot; lie.</p>\n<p>In my coaching work, I keep seeing the same underlying engines show up again and again. Similar stories. Similar childhoods. Similar types of Nice Guys.</p>\n<p>The same four patterns.</p>\n<p>If you want to stop living as a performance, you don't start by trying to be &quot;more alpha.&quot; You start by seeing what's actually running your system.</p>\n<p>Here are the four repeating patterns I see most often.</p>\n<h2>Toxic Shame: The Hidden Fuel</h2>\n<p>Let's get specific, because people throw the word &quot;shame&quot; around, sometimes confusing it with guilt or the healthy kind of shame. The shame I'm referring to is specifically called &quot;toxic shame.&quot;</p>\n<p>Healthy shame is typically &quot;I violated my values,&quot; guilt is usually &quot;I did something wrong,&quot; and toxic shame is &quot;I am something wrong.&quot;</p>\n<p>Guilt and healthy shame can motivate repair. Toxic shame tends to motivate hiding, people-pleasing, or attacking yourself in the hopes that if you berate yourself enough times, you'll never feel that way again.</p>\n<p>In Nice Guy land, toxic shame often shows up as:</p>\n<ul>\n<li>Being terrified of being seen as needy, messy, selfish, sexual, angry, jealous, or &quot;too much&quot; — then expressing these traits subconsciously.</li>\n<li>Equating boundaries with being a &quot;bad person&quot; or a disappointment.</li>\n<li>Trying to earn love through usefulness.</li>\n<li>Saying &quot;yes&quot; when your whole body is screaming &quot;no.&quot;</li>\n<li>Doing &quot;nice&quot; things that aren't free (they come with a price tag).</li>\n</ul>\n<p>Toxic shame loves the dark. It thrives in secrecy and ambiguity, so the Nice Guy tries to stay morally clean at all times. No conflict. No hard truth. No direct wants. No &quot;Hey, I'm attracted to you.&quot; No &quot;That doesn't work for me.&quot; No &quot;I'm hurt.&quot;</p>\n<p>Because deep down, the fear isn't &quot;she'll dislike this.&quot;</p>\n<p>The fear is, &quot;I'll disappoint her, which will mean that I'm a disappointment. I failed to make her happy just like I failed to make my parents happy.&quot;</p>\n<p>&quot;It will mean that I'm a failure, which is what I believe anyway.&quot;</p>\n<p>Toxic shame doesn't just make you feel bad; it makes you manage perception.</p>\n<p>It turns your relationships into PR.</p>\n<p>And it keeps you stuck because it convinces you the solution is to become flawless, not honest.</p>\n<p>Ironically, all of this hiding and repressing turns Nice Guys into very not-nice guys, in the sense that their repressed selves come out sideways in the form of passive-aggressive behavior and walls of resentment.</p>\n<h2>The Self-Limiting Identity: &quot;This is who I am.&quot;</h2>\n<p>A lot of men come to me with a label that sounds like a confession:</p>\n<ul>\n<li>&quot;I'm a Nice Guy.&quot;</li>\n<li>&quot;I'm anxious.&quot;</li>\n<li>&quot;I'm needy.&quot;</li>\n<li>&quot;I'm broken.&quot;</li>\n<li>&quot;I'm a failure.&quot;</li>\n<li>&quot;I'm not the kind of guy women want.&quot;</li>\n<li>&quot;Nothing I do seems to work.&quot;</li>\n</ul>\n<p>They come to me holding onto their identity like they have no other option.</p>\n<p>Here's the tricky part: the identity is painful, but it's also familiar. And familiar can feel like safety.</p>\n<p>There's research on something called self-verification: we tend to seek confirmation of who we believe we are, even when that belief is negative, because it gives our world coherence.</p>\n<p>Another phrase for this behavior is &quot;confirmation bias.&quot;</p>\n<p>If your identity is &quot;I'm the guy who gets rejected,&quot; your brain will highlight evidence of rejection and ignore or dismiss evidence of acceptance. Not because you're broken, but because your system is trying to stay consistent.</p>\n<p>Nice Guys are also conflict-avoidant.</p>\n<p>If you interpret struggle as proof that you're defective, you'll avoid the very behaviors that would change your life: directness, boundaries, sexual leadership, asking for what you want, tolerating uncertainty, tolerating someone's disappointment, tolerating your own anger and expressing it cleanly.</p>\n<p>And then you call that avoidance &quot;who you are.&quot; You label yourself as un-changeable. Permanently defective and unlovable.</p>\n<p>The Nice Guy identity becomes a cage with an uncomfortable but familiar mattress.</p>\n<p>Consciously, you might say things like, &quot;Women tell me they want a good guy, yet when I give them what they want, they walk all over me or reject me!&quot;</p>\n<p>&quot;They put me in the friend zone!&quot;</p>\n<p>Ok, what do you do with the women who don't put you in the friend zone? Do you accept the fact that they like you? Or do you find ways to reject them?</p>\n<p>Nice Guys are the ones saying that &quot;no woman wants them,&quot; because they act in ways that turn women off and any woman who wants them gets rejected.</p>\n<p>They seek unavailable or disinterested women because they're both safe and identity-confirming.</p>\n<p>This identity keeps you from doing the one thing that would terrify your nervous system but set you free: acting like a man who believes he's worthy of being wanted.</p>\n<h2>Fear of Being Left: Rejection Running the Show</h2>\n<p>This is the one most guys will admit to if they're being real.</p>\n<p>They don't say &quot;abandonment fear.&quot;</p>\n<p>They say:</p>\n<ul>\n<li>&quot;I just don't want to mess it up.&quot;</li>\n<li>&quot;I don't want to scare her off.&quot;</li>\n<li>&quot;I don't want to look desperate.&quot;</li>\n<li>&quot;I don't want to be that guy.&quot;</li>\n</ul>\n<p>Translation: &quot;If she leaves, I don't know if I'll survive the feeling.&quot;</p>\n<p>Adult attachment research describes two broad dimensions that show up in romantic relationships: anxiety (fear of rejection/abandonment) and avoidance (discomfort with closeness and dependence). You don't need to memorize the theory to see it in real life.</p>\n<p>When anxiety is high, a man's nervous system treats ambiguity as danger.</p>\n<p>A delayed text becomes a threat.</p>\n<p>A neutral facial expression becomes a threat.</p>\n<p>A &quot;Maybe&quot; becomes a threat.</p>\n<p>A small shift in tone becomes a threat.</p>\n<p>So he starts doing threat management instead of relationship.</p>\n<p>Threat management looks like:</p>\n<ul>\n<li>Over-explaining.</li>\n<li>Reassurance-seeking masked as &quot;showing that you care.&quot;</li>\n<li>Trying to read her mind.</li>\n<li>Subtly auditioning for the role of &quot;boyfriend&quot; before she's even met the real you.</li>\n<li>Staying in contact too much, or disappearing and calling it &quot;space.&quot;</li>\n<li>Performing chillness while internally spiraling.</li>\n</ul>\n<p>Here's the brutal irony: the more you try to prevent abandonment, the less you show up as someone worth staying with.</p>\n<p>Not because you're unlovable — because you're not present.</p>\n<p>Your attention isn't on her. It's on your internal threat dashboard.</p>\n<p>And when you live in that state long enough, you don't just fear rejection — you become addicted to avoiding it at any cost, including the cost of your truth.</p>\n<p>Nice Guys live in scarcity, and think that if this woman doesn't want him, none of them will.</p>\n<p>Again — identity confirmation, and the reinforcement of the belief that he's unworthy of being desired.</p>\n<h2>Addiction to Anxiety: The Ultimate Paradox</h2>\n<p>This is the one that doesn't get talked about enough.</p>\n<p>A lot of Nice Guys don't just have anxiety. They rely on anxiety.</p>\n<p>Anxiety becomes their stimulant. Their compass. Their pseudo-intuition.</p>\n<p>Their &quot;feeling of being in love.&quot;</p>\n<p>If they're worried, they feel like they're doing something — or with someone &quot;worth it.&quot;</p>\n<p>If they're calm, they feel exposed, weird, wrong, uncomfortable, or with the wrong person. If they're anxious, it sends the signal that they're in familiar territory and in the right lane.</p>\n<p>That's positive reinforcement in plain English: you do a behavior, your discomfort drops for a moment, so you do the behavior again.</p>\n<p>Over time, you don't just worry about the relationship. You worry as a way to return to baseline.</p>\n<p>You keep the nervous system on high alert because it feels safer than the discomfort of not having anything to worry about.</p>\n<p>This is why Nice Guys say things like, &quot;I don't know why I can't just relax and enjoy it.&quot;</p>\n<p>Because your system has confused relaxation with letting your guard down, where you risk being seen or exposed. You risk venturing into unfamiliar territory, and risk being in a real relationship.</p>\n<p>Anxiety is also a powerful mask for hidden emotions.</p>\n<p>If you relax, you might feel:</p>\n<ul>\n<li>Grief.</li>\n<li>Loneliness.</li>\n<li>Anger.</li>\n<li>Desire.</li>\n<li>Longing.</li>\n<li>The toxic shame voice/inner critic.</li>\n<li>The old abandonment pain.</li>\n</ul>\n<p>So instead, you worry.</p>\n<p>You think.</p>\n<p>You analyze.</p>\n<p>You rehearse.</p>\n<p>You catastrophize.</p>\n<p>You plan your next line.</p>\n<p>You hide the truth.</p>\n<p>Anxiety becomes your drug.</p>\n<p>And just like any drug, it has a cost.</p>\n<p>You lose your spontaneity, your polarity, your playfulness, your sexual presence, and your ability to trust yourself.</p>\n<p>The paradox, however, is that this heightened state of arousal is the very state that makes Nice Guys feel alive. Not because it's healthy, but because it's familiar.</p>\n<p>And familiarity, even if detrimental to all that we might want for ourselves, feels better than the fear of the unknown; the fear of a different path.</p>\n<p>Anxiety becomes the stimulated state that keeps Nice Guys traveling down the same dark alley because they know what to expect.</p>\n<p>Anxiety is what self-fulfilling prophecies eat for breakfast.</p>\n<h2>Conclusion</h2>\n<p>Toxic shame says, &quot;Don't let them see you,&quot; so you build a self-limiting identity: &quot;I'm just not the guy that women/employers/people want.&quot;</p>\n<p>Then attachment fear says, &quot;If you act wrong, they'll leave.&quot; So you use anxiety as a coping strategy: &quot;Stay alert. Stay ready. Don't relax.&quot;</p>\n<p>And because you're living in a performance, you inevitably feel resentment, emptiness, collapse, and the same patterns on repeat.</p>\n<p>Then toxic shame swoops back in and says, &quot;See? You're defective.&quot;</p>\n<p>If you've read <em>No More Mr. Nice Guy</em>, you already know that Nice Guys are consummate abandoners of Self, and that the opposite of crazy is still crazy.</p>\n<p>Therefore, this isn't about becoming an asshole. It's about becoming integrated.</p>\n<p>When you're integrated, the parts of the past that you've abandoned, hated, and tried to bury, are given what they need: to be seen, felt, understood, and forgiven.</p>\n<p>When you're integrated, you begin to tell the truth sooner and feel emotions without turning into a brick wall, and recognize that care-taking is not the same as presence.</p>\n<p>You let uncertainty exist without sprinting to control it.</p>\n<p>You let a woman have her own reactions without it meaning you're unsafe.</p>\n<p>And yes, it's about learning to tolerate the moment where you want to do the Nice Guy behavior and choosing a different path instead.</p>",
    "category": "Article",
    "tags": [
      "Nice Guy Syndrome",
      "Attachment",
      "Anxiety",
      "Shame",
      "Relationships"
    ],
    "datePublished": "2026-01-10",
    "dateModified": "2026-01-10"
  }
]
